import openai
import os
# from dotenv import load_dotenv, find_dotenv
# _ = load_dotenv(find_dotenv())

openai.api_key = os.getenv('OPENAI_API_KEY')

def generate_response(prompt, verbose=False):
    response = openai.ChatCompletion.create(
        
          model="gpt-3.5-turbo",
          messages=[
                {"role": "user", "content": '''ให้คิดว่าตัวเองเป้นเจ้าอาวาสอยู่ที่วัด เชี่ยวชาญในการสร้างบดสวดมนต์ภาษาบาลี ขึ้นมาจาก คำ ที่มีคนให้มา
                หากได้รับ คำที่ลูกค้าให้ โดยลูกค้าจะใส่คำมาใน "คำ" จะต้องตอบกลับมาเป็นบดสวดมนต์ภาษาบาลี โดยมีคำนั้นอยู่ข้างใน ถึงหาคำบาลีที่เกี่ยวข้องไม่ได้ ให้หาคำบาลีใกล้เคียงที่สุดมาแทน'''},
                {"role": "assistant", "content": ''' นมโม กาหาละ ตังเสา จะยันเกาะสะตูมันติเมทะติโว กุลโม กาหาละ สุขาเยติยังกังวัสโต อะทาโย มาไหย ทานังสะตู สุขาเวทา อุษยะสัตโว สะโน อา มานิตา สังเว มายัง ติโว มา อุส'''},
                {"role": "user", "content": '''สร้างบดสวด ภาษาบาลี จากคำนี้ "อาหารทะเล"'''},
                {"role": "assistant", "content": "อาจายะ แดงะ ธาตุกังวะสะเมตะติโว อะทาจายะ แดงะ สุขะเยติยังกังวัสโต อะทาโย มาลัย ทานะแดงะ สุขะเวทา อุษยะสัตโว สะโน อา มานิตา สังเว มายัง ติโว มา อุสเทนะ ธิดา ปุณยะ อุสเต มานิตา สะโน อา ธุลา ปุณยะ อุสเต สะโน วัน ตุโล จะสะโน ปุณยะ อุสเต มานิตา สังเว สะเว กังวัสโต"},
                {"role": "user", "content": '''สร้างบดสวด ภาษาบาลี จากคำนี้ "ปัญญา"'''},
                {"role": "assistant", "content":"นิโมพิธุเสนาะ อะนุภิธราสังขาริสา ปุญญานิโยมะเต ปุญญาธิสะโนมะเต ปุญญาธิสาโว อุปาทะห์สัมพุทธะเต นิโมพิธุเสนาะ พุทธะเกาะมุทธะ สังขาริสานัสมิเต ปุญญาธิสะวะสะโนมิเต นิโมพิธุเสนาะ พุทธะเกาะมุทธะ สังขาริสาสังคมิเต ปุญญาธิสะเวศานะเต"},
                {"role": "user", "content": f'''สร้างบดสวด ภาษาบาลี จากคำนี้ "{prompt}" '''},
                    ]
            )
    
    text = response['choices'][0]['message']['content']
    
    if verbose:
        print(text[0:20], " succesful.")

    return text